[
    {
        "title": "A saturated 1-system of curves on the surface of genus 3",
        "abstract": "We construct a system of 33 essential simple closed curves that are pairwise non-homotopic and intersect at most once on the oriented, closed surface of genus 3. Moreover, we show that our construction is saturated, in the sense that it is not properly contained in any other such system of curves.",
        "sources": {
            "pdf": "data/1_system_of_curves.pdf",
            "arxiv": "https://arxiv.org/abs/2310.10814",
            "journal": "https://link.springer.com/article/10.1007/s10711-025-01009-2"
        },
        "info": [
            "<i>Geometriae Dedicata</i> <b>219</b> (2025), no. 49"
        ],
        "type": "research"
    },
    {
        "title": "Tree-like graphings of countable Borel equivalence relations",
        "abstract": "Countable Borel equivalence relations (CBERs) have been extensively studied within the framework of descriptive set theory, and a powerful way of analyzing them is by understanding what countable structures one can uniformly assign to each equivalence class in a Borel way. For instance, a graphing of a CBER E is a Borel graph whose connected components are exactly the E-classes, and a CBER is treeable if it admits an acyclic graphing, called a treeing. Treeable CBERs are analogous to free groups, so, naturally, results stating treeability of certain classes of CBERs are difficult to obtain. A recent such result is by Chen, Poulin, Tao, and Tserunyan, stating that if a CBER E admits a locally-finite graphing whose components are quasi-trees, then E is treeable. Their proof uses geometric-group-theoretic ideas and Stone duality, which we will present. Time permitting, we will also discuss a generalization of this result (which they proved as well), that precisely identifies the structure underlying all treeable CBERs. This is an expository talk based on work by Ruiyuan Chen, Antoine Poulin, Ran Tao, and Anush Tserunyan.",
        "sources": {
            "slides": "data/quasi_treeings_slides.pdf"
        },
        "info": [
            "<span style='color: gray'><a href='https://www.math.mcgill.ca/dcl/DDC-Seminar/' target='_blank'><i>Montréal Descriptive Dynamics and Combinatorics Seminar</i></a> (October 1, 2024)</span>"
        ],
        "type": "talk"
    },
    {
        "title": "A saturated 1-system of curves on the surface of genus 3",
        "abstract": "We construct a saturated system of 33 essential simple closed curves that are pairwise non-homotopic and intersect at most once on the oriented, closed surface of genus 3.",
        "info": [
            "<span style='color: gray'><a href='https://www.summ.xyz/' target='_blank'><i>Seminars in Undergraduate Mathematics in Montreal</i></a> (January 6, 2024)</span>",
            "<span style='color: gray'><a href='https://www.math.mcgill.ca/ggt/' target='_blank'><i>McGill Geometric Group Theory Seminar</i></a> (September 27, 2023)</span>"
        ],
        "type": "talk"
    },
    {
        "title": "An exposition of the Ribes-Zalesskii Theorem",
        "abstract": "We give a detailed proof of the Ribes-Zalesskii product theorem for pro-$\\mathcal{C}$ topologies, where $\\mathcal{C}$ is a pseudovariety of groups closed under extensions. The proof relies on geometric properties of the profinite Cayley graph of the pro-$\\mathcal{C}$ completion of free groups, which we develop here following <a href='https://link.springer.com/book/10.1007/978-3-319-61199-0' target='_blank'>[Rib17]</a>.",
        "sources": {
            "pdf": "data/ribes_zalesskii.pdf"
        },
        "info": [
            "<span style='color: gray'>Summer 2025 research project, supervised by Professor <a href='https://www.math.mcgill.ca/msabok/' target='_blank'>Marcin Sabok</a> (in preparation).</span>"
        ],
        "type": "exposition"
    },
    {
        "title": "Quasi-treeings are treeable: a streamlined proof",
        "abstract": "We present a streamlined exposition of a construction by R. Chen, A. Poulin, R. Tao, and A. Tserunyan, which proves the treeability of equivalence relations generated by any locally-finite Borel graph such that each component is a quasi-tree. More generally, we show that if each component of a locally-finite Borel graph admits a finitely-separating Borel family of cuts, then we may ‘canonically’ replace each component of the graph by a tree of special ultrafilter-like objects on cuts called orientations; moreover, if the cuts are dense towards ends, then the union of these trees is a Borel treeing.",
        "sources": {
            "pdf": "data/quasi_treeings.pdf",
            "arxiv": "https://arxiv.org/abs/2409.09843"
        },
        "info": [
            "<span style='color: gray'>Summer 2024 research project, supervised by Professor <a href='https://www.math.mcgill.ca/atserunyan/' target='_blank'>Anush Tserunyan</a>.</span>"
        ],
        "type": "exposition"
    },
    {
        "title": "Hilbert’s Fifth Problem",
        "abstract": "Following <a href='https://terrytao.wordpress.com/books/hilberts-fifth-problem-and-related-topics/' target='_blank'>[Tao14]</a>, we provide a sketch of Hilbert’s Fifth Problem, which asks for a topological characterization of Lie groups. To do so, we prove (part of) a deep structural result of Gleason and Yamabe on locally-compact groups, stating that they contain an inverse limit of Lie groups as an open subgroup.",
        "sources": {
            "pdf": "data/hilberts_fifth.pdf"
        },
        "info": [
            "<span style='color: gray'>Project for <i>MATH599: Lie Groups and their Representations</i>, by Professor <a href='https://www.math.mcgill.ca/jkamni/' target='_blank'>Joel Kamnitzer</a>.</span>"
        ],
        "type": "exposition"
    },
    {
        "title": "Moduli Spaces of Riemann Surfaces",
        "abstract": "The theory of Riemann surfaces, first developed by Bernhard Riemann to study algebraic functions, now lies in the confluence of complex analysis, differential geometry, and algebraic geometry. This expository paper aims to introduce this theory, with the goal classifying all compact Riemann surfaces of genus 0 and 1. To do so, we first develop the basics of covering space theory, which defines the degree of proper holomorphic maps, and then study the sheaf of holomorphic maps on a Riemann surface and their associated cohomology theory. Together, they form the core technical tools of the paper and allow us to connect the function theory of Riemann surfaces to their complex structure. Lastly, we give a glimpse into the non-compact case, namely the Uniformization Theorem, which gives us a tri-fold classification of all Riemann surfaces.",
        "sources": {
            "pdf": "data/moduli_spaces.pdf"
        },
        "info": [
            "<span style='color: gray'>Report for McGill's Winter 2023 <a href='https://math.mcgill.ca/gsams/drp/' target='_blank'>Directed Reading Program</a>, supervised by <a href='https://kaleb.ruscitti.ca/' target='_blank'>Kaleb Ruscitti</a>.</span>"
        ],
        "type": "exposition"
    },
    {
        "title": "Bounded Arithmetic, Constant-depth Frege Proofs, and the Linear Time Hierarchy",
        "sources": {
            "slides": "data/bounded_arithmetic.pdf"
        },
        "info": [
            "<span style='color: gray'>Project for <i>COMP532: Propositional Proof Complexity</i>, by Professor <a href='https://www.cs.mcgill.ca/~robere/' target='_blank'>Robert Robere</a>.</span>",
            "<span style='color: gray'>Joint with Nathan Acheampong.</span>"
        ],
        "type": "exposition"
    },
    {
        "title": "Subject reduction for pure type systems",
        "abstract": "Following <a href='https://www.cambridge.org/core/journals/journal-of-functional-programming/article/modular-proof-of-strong-normalization-for-the-calculus-of-constructions/348B6914C707F5282ED91E08AE47BDB8' target='_blank'>[GN91]</a> and <a href='https://www.cambridge.org/core/journals/journal-of-functional-programming/article/introduction-to-generalized-type-systems/869991BA6A99180BF96A616894C6D710' target='_blank'>[Bar91]</a>, we study the basics of <i>pure type systems</i>, which abstract many of the constructs found in the eight systems of the $\\lambda$-cube. We start with a brief introduction to the systems of the $\\lambda$-cube, discuss their expressive power, and introduce pure type systems as a unifying framework in which they can be studied. We then give a detailed proof of subject reduction for arbitrary pure type systems.",
        "sources": {
            "pdf": "data/subject_reduction.pdf"
        },
        "info": [
            "<span style='color: gray'>Project for <i>COMP527: Logic and Computation</i>, by Professor <a href='https://www.cs.mcgill.ca/~bpientka/' target='_blank'>Brigitte Pientka</a>.</span>",
            "<span style='color: gray'>Joint with Charlotte Marchal, Dashiell Rich, and Milton Rosenbaum.</span>"
        ],
        "type": "exposition"
    }
]
